In [3]:
import pandas as pd
df = pd.read_csv('datasets/Salarios.csv')

In [4]:
df.head() # Muestra las primeras 5 filas del DataFrame

              Position  Level  Salary
0  Operational Support      1   45000
1           Analyst II      2   50000
2            Analyst I      3   60000
3         Associate II      4   80000
4           Asociate I      5  110000

In [6]:
df.tail() # Muestra las ultimas 5 filas del DataFrame

                Position  Level   Salary
7      Senior Manager II      8   300000
8     Senior Manager I        9   500000
9   Principal Manager II     10  1000000
10   Principal Manager I     11  1400000
11               C-Level     12  1800000

In [7]:
df.sample(7) # Muestra 7 filas aleatorias del DataFrame

                Position  Level   Salary
0    Operational Support      1    45000
9   Principal Manager II     10  1000000
7      Senior Manager II      8   300000
8     Senior Manager I        9   500000
1             Analyst II      2    50000
10   Principal Manager I     11  1400000
11               C-Level     12  1800000

In [8]:
df.columns # Muestra los nombres de las columnas del DataFrame

Index(['Position', 'Level', 'Salary'], dtype='object')

In [9]:
df.shape # Muestra la cantidad de filas y columnas del DataFrame

(12, 3)

In [12]:
df.iloc[3] # Muestra la fila en la posicion 3

Position    Associate II
Level                  4
Salary             80000
Name: 3, dtype: object

In [16]:
df.iloc[1,2] # Muestra el valor en la fila 1, columna 2

np.int64(50000)

In [17]:
df.iloc[10:21,1:3] # Muestra las filas de la 10 a la 20 y las columnas 1 y 2

    Level   Salary
10     11  1400000
11     12  1800000

In [18]:
df.iloc[:5] # Muestra las primeras 5 filas del DataFrame

              Position  Level  Salary
0  Operational Support      1   45000
1           Analyst II      2   50000
2            Analyst I      3   60000
3         Associate II      4   80000
4           Asociate I      5  110000

In [19]:
df.iloc[:3,:2] # Muestra las primeras 3 filas y las primeras 2 columnas del DataFrame

              Position  Level
0  Operational Support      1
1           Analyst II      2
2            Analyst I      3

In [20]:
# loc -> Es como iloc(indexlocation) pero usando etiquetas en lugar de posiciones
df.loc[3, 'Salary'] # Muestra el valor en la fila con indice 3 y la columna 'Salary'

np.int64(80000)

In [22]:
df.loc[:3, ['Position', 'Salary']] # Muestra las primeras 4 filas y las columnas 'Name' y 'Salary'

              Position  Salary
0  Operational Support   45000
1           Analyst II   50000
2            Analyst I   60000
3         Associate II   80000